IlleniumDillon/MM32F5277/PinMap/MM32_GPIO_PinMap.h
#ifndef _MM32_GPIO_PINMAP_H_
#define _MM32_GPIO_PINMAP_H_

#include <MM32_PinMapType.h>

extern MM32_GPIO_Pin PA0;
extern MM32_GPIO_Pin PA1;
extern MM32_GPIO_Pin PA2;
extern MM32_GPIO_Pin PA3;
extern MM32_GPIO_Pin PA4;
extern MM32_GPIO_Pin PA5;
extern MM32_GPIO_Pin PA6;
extern MM32_GPIO_Pin PA7;
extern MM32_GPIO_Pin PA8;
extern MM32_GPIO_Pin PA9;
extern MM32_GPIO_Pin PA10;
extern MM32_GPIO_Pin PA11;
extern MM32_GPIO_Pin PA12;
extern MM32_GPIO_Pin PA13;
extern MM32_GPIO_Pin PA14;
extern MM32_GPIO_Pin PA15;

extern MM32_GPIO_Pin PB0;
extern MM32_GPIO_Pin PB1;
extern MM32_GPIO_Pin PB2;
extern MM32_GPIO_Pin PB3;
extern MM32_GPIO_Pin PB4;
extern MM32_GPIO_Pin PB5;
extern MM32_GPIO_Pin PB6;
extern MM32_GPIO_Pin PB7;
extern MM32_GPIO_Pin PB8;
extern MM32_GPIO_Pin PB9;
extern MM32_GPIO_Pin PB10;
extern MM32_GPIO_Pin PB11;
extern MM32_GPIO_Pin PB12;
extern MM32_GPIO_Pin PB13;
extern MM32_GPIO_Pin PB14;
extern MM32_GPIO_Pin PB15;

extern MM32_GPIO_Pin PC0;
extern MM32_GPIO_Pin PC1;
extern MM32_GPIO_Pin PC2;
extern MM32_GPIO_Pin PC3;
extern MM32_GPIO_Pin PC4;
extern MM32_GPIO_Pin PC5;
extern MM32_GPIO_Pin PC6;
extern MM32_GPIO_Pin PC7;
extern MM32_GPIO_Pin PC8;
extern MM32_GPIO_Pin PC9;
extern MM32_GPIO_Pin PC10;
extern MM32_GPIO_Pin PC11;
extern MM32_GPIO_Pin PC12;
extern MM32_GPIO_Pin PC13;
extern MM32_GPIO_Pin PC14;
extern MM32_GPIO_Pin PC15;

extern MM32_GPIO_Pin PD0;
extern MM32_GPIO_Pin PD1;
extern MM32_GPIO_Pin PD2;
extern MM32_GPIO_Pin PD3;
extern MM32_GPIO_Pin PD4;
extern MM32_GPIO_Pin PD5;
extern MM32_GPIO_Pin PD6;
extern MM32_GPIO_Pin PD7;
extern MM32_GPIO_Pin PD8;
extern MM32_GPIO_Pin PD9;
extern MM32_GPIO_Pin PD10;
extern MM32_GPIO_Pin PD11;
extern MM32_GPIO_Pin PD12;
extern MM32_GPIO_Pin PD13;
extern MM32_GPIO_Pin PD14;
extern MM32_GPIO_Pin PD15;

extern MM32_GPIO_Pin PE0;
extern MM32_GPIO_Pin PE1;
extern MM32_GPIO_Pin PE2;
extern MM32_GPIO_Pin PE3;
extern MM32_GPIO_Pin PE4;
extern MM32_GPIO_Pin PE5;
extern MM32_GPIO_Pin PE6;
extern MM32_GPIO_Pin PE7;
extern MM32_GPIO_Pin PE8;
extern MM32_GPIO_Pin PE9;
extern MM32_GPIO_Pin PE10;
extern MM32_GPIO_Pin PE11;
extern MM32_GPIO_Pin PE12;
extern MM32_GPIO_Pin PE13;
extern MM32_GPIO_Pin PE14;
extern MM32_GPIO_Pin PE15;

extern MM32_GPIO_Pin PF0;
extern MM32_GPIO_Pin PF1;
extern MM32_GPIO_Pin PF2;
extern MM32_GPIO_Pin PF3;
extern MM32_GPIO_Pin PF4;
extern MM32_GPIO_Pin PF5;
extern MM32_GPIO_Pin PF6;
extern MM32_GPIO_Pin PF7;
extern MM32_GPIO_Pin PF8;
extern MM32_GPIO_Pin PF9;
extern MM32_GPIO_Pin PF10;
extern MM32_GPIO_Pin PF11;
extern MM32_GPIO_Pin PF12;
extern MM32_GPIO_Pin PF13;
extern MM32_GPIO_Pin PF14;
extern MM32_GPIO_Pin PF15;

extern MM32_GPIO_Pin PG0;
extern MM32_GPIO_Pin PG1;
extern MM32_GPIO_Pin PG2;
extern MM32_GPIO_Pin PG3;
extern MM32_GPIO_Pin PG4;
extern MM32_GPIO_Pin PG5;
extern MM32_GPIO_Pin PG6;
extern MM32_GPIO_Pin PG7;
extern MM32_GPIO_Pin PG8;
extern MM32_GPIO_Pin PG9;
extern MM32_GPIO_Pin PG10;
extern MM32_GPIO_Pin PG11;
extern MM32_GPIO_Pin PG12;
extern MM32_GPIO_Pin PG13;
extern MM32_GPIO_Pin PG14;
extern MM32_GPIO_Pin PG15;

extern MM32_GPIO_Pin PH0;
extern MM32_GPIO_Pin PH1;
extern MM32_GPIO_Pin PH2;
extern MM32_GPIO_Pin PH3;

extern MM32_GPIO_Pin PI0;
extern MM32_GPIO_Pin PI1;


#endif